function generate() {
  let quotes = [
    {
      quote:
        "Що розум людини може осягнути і в що він може повірити, те він здатний досягти.",
      author: "- Наполеон Хілл",
    },
    {
      quote: "Прагніть не до успіху, а до цінностей, які він дає.",
      author: "- Альберт Eйнштейн",
    },
    {
      quote:
        "Своїм успіхом я зобов’язана тому, що ніколи не виправдовувалася і не приймала виправдань від інших.",
      author: "- Флоренс Найтінгейл",
    },
    {
      quote:
        "Найскладніше почати діяти, все інше залежить тільки від наполегливості.",
      author: "- Амелія Ергарт",
    },
    {
      quote: "Життя – це те, що з тобою відбувається, поки ти будуєш плани.",
      author: "- Джон Леннон",
    },
    {
      quote:
        "Логіка може привести вас. від пункту “А” до пункту “Б”, а уява – куди завгодно",
      author: "- Альберт Eйнштейн",
    },
    {
      quote: "Неосмислене життя не варте того, щоб його прожити.",
      author: "- Сократ",
    },
    {
      quote: "80% успіху — це з’явитися в потрібному місці в потрібний час.",
      author: "- Вуді Аллен",
    },
    {
      quote: "Ваш час обмежений, не витрачайте його, живучи чужим життям.",
      author: "- Стів Джобс",
    },
    {
      quote: "Перемога – це ще не все, все – це постійне бажання перемагати.",
      author: "- Вінс Ломбарді",
    },
    {
      quote:
        "Наука – це організовані знання, мудрість – це організоване життя.",
      author: "- Іммануїл Кант",
    },
    {
      quote: "У моєму словнику немає слова “неможливо”.",
      author: "- Наполеон Бонапарт",
    },
    {
      quote:
        "Ви ніколи не перетнете океан, якщо не наберетеся мужності втратити берег з виду.",
      author: "- Христофор Колумб",
    },
    {
      quote:
        "Свобода нічого не варта, якщо вона не включає в себе свободу помилятися.",
      author: "- Махатма Ганді",
    },
    {
      quote:
        "Якщо ви думаєте, що ви здатні на щось, ви маєте рацію, якщо ви думаєте, що у вас не вийде щось, ви теж маєте рацію.",
      author: "- Генрі Форд",
    },
    {
      quote:
        "Два найважливіших дні у твоєму житті: день, коли ти з’явився на світ, і день, коли ти зрозумів навіщо.",
      author: "- Марк Твен",
    },
    { quote: "Найкраща помста – величезний успіх.", author: "- Френк Сінатра" },
    {
      quote:
        "Є тільки один спосіб уникнути критики: нічого не робіть, нічого не говоріть і будьте ніким.",
      author: "- Аристотель",
    },
    {
      quote:
        "Краще бути впевненим в хорошому результаті, ніж сподіватися на відмінний.",
      author: "- Воррен Баффетт",
    },
    {
      quote:
        "Варто тільки повірити, що ви можете – і ви вже на півдороги до цілі.",
      author: "- Теодор Рузвельт",
    },
  ];

  let randomIndex = Math.floor(Math.random() * quotes.length);
  let randomQuote = quotes[randomIndex];

  document.getElementById("quote").innerHTML = randomQuote.quote;
  document.getElementById("author").innerHTML = randomQuote.author;
}

document.getElementById("btn-click").addEventListener("click", generate);
